Autodesk.Revit.DB.ContourSetting.GetContourSettingItems
Get all contour setting items.
Returns:
An array of contour setting items.
Since:
2024

Autodesk.Revit.DB.ContourSetting.EnableItem(Autodesk.Revit.DB.ContourSettingItem)
Enable a contour setting item of the current contour setting so that the item will be used to draw contours.
Remarks:
Contour setting will not be changed if the item could not be found.
item:
The contour setting item to be enabled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ContourSetting.DisableItem(Autodesk.Revit.DB.ContourSettingItem)
Disable a contour setting item of the current contour setting so that the item will not be used to draw contours.
Remarks:
Contour setting will not be changed if the item could not be found.
item:
The contour setting item to be disabled.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ContourSetting.RemoveItem(Autodesk.Revit.DB.ContourSettingItem)
Remove a contour setting item from the current contour setting.
Remarks:
Contour setting will not be changed if the item could not be found.
item:
The contour setting item to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ContourSetting.GetItemIndex(Autodesk.Revit.DB.ContourSettingItem)
Get the index of a contour setting item of the current contour setting
item:
The contour setting item.
Returns:
The index of the input contour setting item.
-1 if the item is not found.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ContourSetting.AddContourRange(System.Double,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Add a set of contours as a contour setting item to the current contour setting.
start:
The contour range start elevation.
stop:
The contour range stop elevation.
Should be greater than start elevation.
step:
The increment elevation of the contour range.
Should be greater than zero.
subcategoryId:
The contour line style subcategory id.
Returns:
The newly added contour setting item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for start is not finite
-or-
The given value for stop is not finite
-or-
The given value for step is not finite
-or-
The input subcategory id is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The input contour spacing information is not valid.
Since:
2024

Autodesk.Revit.DB.ContourSetting.AddSingleContour(System.Double,Autodesk.Revit.DB.ElementId)
Add a single contour as a contour setting item to the current contour setting.
elevation:
The contour elevation.
subcategoryId:
The contour line style subcategory id.
Returns:
The newly added contour setting item.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for elevation is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.ContourSetting.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ContourSetting
Contour setting object that handles the contour information used to draw contours on elements.
Since:
2024